# config.py
BOT_TOKEN = "8613134391:AAEfV8sqV7_Kh5g9KG5xT8S9mwl0eqVxFBI"
OWNER_ID = 5010882230
OWNER_NAME = "༺۝༒♛ 🅰🇳🇦🇸 ♛༒۝༻"

# المجموعات المسموحة (IDs)
ALLOWED_GROUPS = [-1002695848824, -1003721123319, -1002052564369]

# رسالة رد كلمة "بوت"
MSG_BOT_REPLY = """
👑 انا ملك الالعاب 👑

👈موجود هنا للتسلية 👉

☠️ اذا كنت جاهزا للعب والتحدي ☠️

🌹🌹فهيا بنا نلعب 🌹🌹

⛔ يمنع اللعب اثناء الصلاة وباوقات الصلاوات⛔
"""

def get_rank_name(level):
    if level < 10: return "🆕 عضو جديد"
    if level < 50: return "🥉 برونزي"
    if level < 150: return "🥇 ذهبي"
    return "👑 ملك التفاعل"
