# 👑 إعدادات النظام الملكي - إمبراطورية مونوبولي 2026 👑

# --- الإعدادات الأساسية للاتصال ---
OWNER_ID = 5010882230
BOT_TOKEN = "8613134391:AAEVB1ta3-2ZpiOtx3ULk9yOcWFCBKh06Qs"
# اجعلها هكذا في ملف config.py
GROUP_IDS = [
    -5223684681,
    -1003960606586,
    -1002052564369,
    -1003721123319
]
# --- إعدادات الجوائز والمسابقات (لتحكم أسهل) ---
GUESS_PRIZE = 100000       # جائزة التخمين
GAME_PRIZE = 50000         # جائزة الألعاب العادية
DAILY_REWARD = 10000       # المكافأة اليومية
CARDS_TO_WIN = 5           # عدد مرات الفوز المطلوبة للحصول على بطاقة ألبوم

# --- سطر التحديث لإجبار المنصة على تغيير الرقم ---
# LAST_UPDATE: 2026-03-12 | VERSION: 3.0.0_ROYAL_FINAL
