# games.py
import random

ALL_QUESTIONS = {
    "دين": [("أول المؤذنين؟", "بلال بن رباح"), ("أطول سورة؟", "البقرة"), ("خاتم الأنبياء؟", "محمد"), ("سورة ثلث القرآن؟", "الإخلاص"), ("مرضعة النبي؟", "حليمة السعدية"), ("عدد الخلفاء؟", "4"), ("غزوة رمضان؟", "بدر"), ("مبدأ التقويم الهجري؟", "الهجرة")],
    "عواصم": [("عاصمة الأردن؟", "عمان"), ("عاصمة فرنسا؟", "باريس"), ("عاصمة اليابان؟", "طوكيو"), ("عاصمة مصر؟", "القاهرة"), ("عاصمة فلسطين؟", "القدس"), ("عاصمة لبنان؟", "بيروت"), ("عاصمة قطر؟", "الدوحة")],
    "اندية": [("نادي الملكي؟", "ريال مدريد"), ("نادي كتالونيا؟", "برشلونة"), ("نادي ليفربول في؟", "إنجلترا"), ("نادي النصر؟", "السعودية"), ("نادي الهلال؟", "السعودية"), ("نادي ميلان؟", "إيطاليا")],
    "ترتيب": [("ر ا ل د و ن و", "رونالدو"), ("س ي م ي", "ميسي"), ("ب ر ش ل و ن ة", "برشلونة"), ("م د ر ي د", "مدريد"), ("ا ل ه ل ا ل", "الهلال")],
    "رياضيات": [("5+5*2", "15"), ("100/4", "25"), ("9*9", "81"), ("12*12", "144")]
}

async def get_game_data(game_type):
    if game_type in ALL_QUESTIONS:
        return random.choice(ALL_QUESTIONS[game_type])
    return None, None
