# royal.py
import random
from tinydb import TinyDB, Query

db = TinyDB('bank_data.json')
User = Query()

MSG_ROULETTE_START = "🔥🔥 يا شعب مونوبولي العظيم 🔥🔥\n\n👈 لقد بدأت لعبة الروليت 👉\n\n🌹🌹 ليتم تسجيل اشتراكك في الجولة اكتب انا 🌹🌹"
MSG_ROULETTE_JOIN = "📢🔥🌹 لقد تم تسجيلك يا بطل 🌹🔥📢"
MSG_ROULETTE_WIN = "👑👑 مبااااارك عليك الفوز يا اسطورة 👑👑\n\n          👑 \" {name} \" 👑\n\n🏆 فوزك رقم: ( {wins} )\n\n👈👈 استمر معنا بالمشاركة حتى تربح الجائزة الكبرى 👉👉"
MSG_ROULETTE_KING = "👑👑👑 ملك الروليت 👑👑👑\n\n             👑 \" {name} \" 👑\n\n       🔥🔥 \"فاز بـ {wins} جولات متتالية\"🔥🔥"

async def get_top_active():
    all_users = db.all()
    if not all_users: return "لا يوجد بيانات."
    top = max(all_users, key=lambda x: x.get('points', 0))
    return f"🔥🔥🔥 ملك التفاعل 🔥🔥\n\nاسم الملك : {top['name']}\n\nنقاطه : {top['points']}\n\n🏆 مباارك يا أسطورة!"
